# Задание 14 из ЕГЭ-2025 профиль [https://math-ege.sdamgia.ru/test?id=85684731]
# Даны векторы а = (2, 1) b = (2, -4) - Найдите скалярное произведение векторов a+b и 7a-b

a = (5, -7)
b = (14, 1)

print(a[0]*b[0] + a[1]*b[1])
